apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_gpc.h
/* CM Authentication Control (CM_AUTHEN_CTRL) */
#define GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_USER              (1 << 0)   /* Bit 0: Allow user mode access */
#define GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_NONSECURE         (1 << 1)   /* Bit 1: Allow non-secure mode access */
#define GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_LOCK_SETTING      (1 << 4)   /* Bit 4: Lock NONSECURE and USER */
#define GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_WHITE_LIST_SHIFT  (8)        /* Bits 8-12: Domain ID white list */
#define GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_WHITE_LIST_MASK   (0xF << GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_WHITE_LIST_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_WHITE_LIST(n)     (((n) << GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_WHITE_LIST_SHIFT) & GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_WHITE_LIST_MASK)
#define GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_LOCK_LIST         (1 << 12)  /* Bit 12: White list lock */
#define GPC_CPU_MODE_CTRL_CM_AUTHEN_CTRL_LOCK_CFG          (1 << 20)  /* Bit 20: Configuration lock */

/* CM Interrupt Control (CM_INT_CTRL) */
#define GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_SLEEP_INT_EN   (1 << 0)   /* Bit 0: sp_req_not_allowed_for_sleep interrupt enable */
#define GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_WAKEUP_INT_EN  (1 << 1)   /* Bit 1: sp_req_not_allowed_for_wakeup interrupt enable */
#define GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_SOFT_INT_EN    (1 << 2)   /* Bit 2: sp_req_not_allowed_for_soft interrupt enable */
#define GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_SLEEP_INT      (1 << 16)  /* Bit 16: sp_req_not_allowed_for_sleep interrupt status and clear register */
#define GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_WAKEUP_INT     (1 << 17)  /* Bit 17: sp_req_not_allowed_for_wakeup interrupt status and clear register */
#define GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_SOFT_INT       (1 << 18)  /* Bit 18: sp_req_not_allowed_for_soft interrupt status and clear register */

/* Miscellaneous (CM_MISC) */
#define GPC_CPU_MODE_CTRL_CM_MISC_NMI_STAT         (1 << 0)  /* Bit 0: Non-masked interrupt status */
#define GPC_CPU_MODE_CTRL_CM_MISC_SLEEP_HOLD_EN    (1 << 1)  /* Bit 1: Allow cpu_sleep_hold_req assert during CPU low power status */
#define GPC_CPU_MODE_CTRL_CM_MISC_SLEEP_HOLD_STAT  (1 << 2)  /* Bit 2: Status of cpu_sleep_hold_ack_b */
#define GPC_CPU_MODE_CTRL_CM_MISC_MASTER_CPU       (1 << 4)  /* Bit 4: Master CPU */

#define GPC_CPU_MODE_RUN_MODE                      (0x0)
#define GPC_CPU_MODE_WAIT_MODE                     (0x1)
#define GPC_CPU_MODE_STOP_MODE                     (0x2)
#define GPC_CPU_MODE_SUSPEND_MODE                  (0x3)

/* CPU mode control (CM_MODE_CTRL) */
#define GPC_CPU_MODE_CTRL_CM_MODE_CTRL_CPU_MODE_TARGET_SHIFT  (0)       /* Bits 0-2: The CPU mode the CPU platform should transit to on next sleep event */
#define GPC_CPU_MODE_CTRL_CM_MODE_CTRL_CPU_MODE_TARGET_MASK   (0x3 << GPC_CPU_MODE_CTRL_CM_MODE_CTRL_CPU_MODE_TARGET_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_MODE_CTRL_CPU_MODE_TARGET(n)     (((n) << GPC_CPU_MODE_CTRL_CM_MODE_CTRL_CPU_MODE_TARGET_SHIFT) & GPC_CPU_MODE_CTRL_CM_MODE_CTRL_CPU_MODE_TARGET_MASK)
#define GPC_CPU_MODE_CTRL_CM_MODE_CTRL_WFE_EN                 (1 << 4)  /* Bit 4: WFE assertion can be sleep event */

/* CM CPU mode Status (CM_MODE_STAT) */
#define GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_CURRENT_SHIFT   (0)  /* Bits 0-2: Current CPU mode */
#define GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_CURRENT_MASK    (0x3 << GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_CURRENT_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_CURRENT(n)      (((n) << GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_CURRENT_SHIFT) & GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_CURRENT_MASK)
#define GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_PREVIOUS_SHIFT  (2)  /* Bits 2-4: Previous CPU mode */
#define GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_PREVIOUS_MASK   (0x3 << GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_PREVIOUS_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_PREVIOUS(n)     (((n) << GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_PREVIOUS_SHIFT) & GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_PREVIOUS_MASK)

/* CM IRQ0~31 wakeup mask (CM_IRQ_WAKEUP_MASK_0) */
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_0_IRQ_WAKEUP_MASK_0_31_SHIFT  (0)  /* Bits 0-32: "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_0_IRQ_WAKEUP_MASK_0_31_MASK   (0xFFFFFFFF << GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_0_IRQ_WAKEUP_MASK_0_31_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_0_IRQ_WAKEUP_MASK_0_31(n)     (((n) << GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_0_IRQ_WAKEUP_MASK_0_31_SHIFT) & GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_0_IRQ_WAKEUP_MASK_0_31_MASK)

/* CM IRQ32~63 wakeup mask (CM_IRQ_WAKEUP_MASK_1) */
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_1_IRQ_WAKEUP_MASK_32_63_SHIFT  (0)  /* Bits 0-32: "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_1_IRQ_WAKEUP_MASK_32_63_MASK   (0xFFFFFFFF << GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_1_IRQ_WAKEUP_MASK_32_63_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_1_IRQ_WAKEUP_MASK_32_63(n)     (((n) << GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_1_IRQ_WAKEUP_MASK_32_63_SHIFT) & GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_1_IRQ_WAKEUP_MASK_32_63_MASK)

/* CM IRQ64~95 wakeup mask (CM_IRQ_WAKEUP_MASK_2) */
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_2_IRQ_WAKEUP_MASK_64_95_SHIFT  (0)  /* Bits 0-32: "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_2_IRQ_WAKEUP_MASK_64_95_MASK   (0xFFFFFFFF << GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_2_IRQ_WAKEUP_MASK_64_95_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_2_IRQ_WAKEUP_MASK_64_95(n)     (((n) << GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_2_IRQ_WAKEUP_MASK_64_95_SHIFT) & GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_2_IRQ_WAKEUP_MASK_64_95_MASK)

/* CM IRQ96~127 wakeup mask (CM_IRQ_WAKEUP_MASK_3) */
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_3_IRQ_WAKEUP_MASK_96_127_SHIFT  (0)  /* Bits 0-32: "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_3_IRQ_WAKEUP_MASK_96_127_MASK   (0xFFFFFFFF << GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_3_IRQ_WAKEUP_MASK_96_127_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_3_IRQ_WAKEUP_MASK_96_127(n)     (((n) << GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_3_IRQ_WAKEUP_MASK_96_127_SHIFT) & GPC_CPU_MODE_CTRL_CM_IRQ_WAKEUP_MASK_3_IRQ_WAKEUP_MASK_96_127_MASK)

