apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_gpc.h
/* CM Setpoint 11 Mapping (CM_SP11_MAPPING) */
#define GPC_CPU_MODE_CTRL_CM_SP11_MAPPING_CPU_SP11_MAPPING_SHIFT  (0)  /* Bits 0-16: Defines when SP11 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field */
#define GPC_CPU_MODE_CTRL_CM_SP11_MAPPING_CPU_SP11_MAPPING_MASK   (0xFFFF << GPC_CPU_MODE_CTRL_CM_SP11_MAPPING_CPU_SP11_MAPPING_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_SP11_MAPPING_CPU_SP11_MAPPING(n)     (((n) << GPC_CPU_MODE_CTRL_CM_SP11_MAPPING_CPU_SP11_MAPPING_SHIFT) & GPC_CPU_MODE_CTRL_CM_SP11_MAPPING_CPU_SP11_MAPPING_MASK)

/* CM Setpoint 12 Mapping (CM_SP12_MAPPING) */
#define GPC_CPU_MODE_CTRL_CM_SP12_MAPPING_CPU_SP12_MAPPING_SHIFT  (0)  /* Bits 0-16: Defines when SP12 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field */
#define GPC_CPU_MODE_CTRL_CM_SP12_MAPPING_CPU_SP12_MAPPING_MASK   (0xFFFF << GPC_CPU_MODE_CTRL_CM_SP12_MAPPING_CPU_SP12_MAPPING_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_SP12_MAPPING_CPU_SP12_MAPPING(n)     (((n) << GPC_CPU_MODE_CTRL_CM_SP12_MAPPING_CPU_SP12_MAPPING_SHIFT) & GPC_CPU_MODE_CTRL_CM_SP12_MAPPING_CPU_SP12_MAPPING_MASK)

/* CM Setpoint 13 Mapping (CM_SP13_MAPPING) */
#define GPC_CPU_MODE_CTRL_CM_SP13_MAPPING_CPU_SP13_MAPPING_SHIFT  (0)  /* Bits 0-16: Defines when SP13 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field */
#define GPC_CPU_MODE_CTRL_CM_SP13_MAPPING_CPU_SP13_MAPPING_MASK   (0xFFFF << GPC_CPU_MODE_CTRL_CM_SP13_MAPPING_CPU_SP13_MAPPING_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_SP13_MAPPING_CPU_SP13_MAPPING(n)     (((n) << GPC_CPU_MODE_CTRL_CM_SP13_MAPPING_CPU_SP13_MAPPING_SHIFT) & GPC_CPU_MODE_CTRL_CM_SP13_MAPPING_CPU_SP13_MAPPING_MASK)

/* CM Setpoint 14 Mapping (CM_SP14_MAPPING) */
#define GPC_CPU_MODE_CTRL_CM_SP14_MAPPING_CPU_SP14_MAPPING_SHIFT  (0)  /* Bits 0-16: Defines when SP14 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field */
#define GPC_CPU_MODE_CTRL_CM_SP14_MAPPING_CPU_SP14_MAPPING_MASK   (0xFFFF << GPC_CPU_MODE_CTRL_CM_SP14_MAPPING_CPU_SP14_MAPPING_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_SP14_MAPPING_CPU_SP14_MAPPING(n)     (((n) << GPC_CPU_MODE_CTRL_CM_SP14_MAPPING_CPU_SP14_MAPPING_SHIFT) & GPC_CPU_MODE_CTRL_CM_SP14_MAPPING_CPU_SP14_MAPPING_MASK)

/* CM Setpoint 15 Mapping (CM_SP15_MAPPING) */
#define GPC_CPU_MODE_CTRL_CM_SP15_MAPPING_CPU_SP15_MAPPING_SHIFT  (0)  /* Bits 0-16: Defines when SP15 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field */
#define GPC_CPU_MODE_CTRL_CM_SP15_MAPPING_CPU_SP15_MAPPING_MASK   (0xFFFF << GPC_CPU_MODE_CTRL_CM_SP15_MAPPING_CPU_SP15_MAPPING_SHIFT)
#define GPC_CPU_MODE_CTRL_CM_SP15_MAPPING_CPU_SP15_MAPPING(n)     (((n) << GPC_CPU_MODE_CTRL_CM_SP15_MAPPING_CPU_SP15_MAPPING_SHIFT) & GPC_CPU_MODE_CTRL_CM_SP15_MAPPING_CPU_SP15_MAPPING_MASK)

/* CM standby control (CM_STBY_CTRL) */
#define GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_WAIT         (1 << 0)   /* Bit 0: 0x1: Request the chip into standby mode when CPU entering WAIT mode, locked by LOCK_CFG field. */
#define GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_STOP         (1 << 1)   /* Bit 1: 0x1: Request the chip into standby mode when CPU entering STOP mode, locked by LOCK_CFG field. */
#define GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_SUSPEND      (1 << 2)   /* Bit 2: 0x1: Request the chip into standby mode when CPU entering SUSPEND mode, locked by LOCK_CFG field. */
#define GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_SLEEP_BUSY   (1 << 16)  /* Bit 16: Indicate the CPU is busy entering standby mode. */
#define GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_WAKEUP_BUSY  (1 << 17)  /* Bit 17: Indicate the CPU is busy exiting standby mode. */

/* GPC_SET_POINT_CTRL Register Offsets *******************************************/
#define IMXRT_GPC_SET_POINT_CTRL_OFFSET                       (0x2000)
#define IMXRT_GPC_SET_POINT_CTRL_SP_AUTHEN_CTRL_OFFSET        (0x0004)
#define IMXRT_GPC_SET_POINT_CTRL_SP_INT_CTRL_OFFSET           (0x0008)
#define IMXRT_GPC_SET_POINT_CTRL_SP_CPU_REQ_OFFSET            (0x0010)
#define IMXRT_GPC_SET_POINT_CTRL_SP_SYS_STAT_OFFSET           (0x0014)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ROSC_CTRL_OFFSET          (0x001c)
#define IMXRT_GPC_SET_POINT_CTRL_SP_PRIORITY_0_7_OFFSET       (0x0040)
#define IMXRT_GPC_SET_POINT_CTRL_SP_PRIORITY_8_15_OFFSET      (0x0044)
#define IMXRT_GPC_SET_POINT_CTRL_SP_SSAR_SAVE_CTRL_OFFSET     (0x0100)
#define IMXRT_GPC_SET_POINT_CTRL_SP_LPCG_OFF_CTRL_OFFSET      (0x0110)
#define IMXRT_GPC_SET_POINT_CTRL_SP_GROUP_DOWN_CTRL_OFFSET    (0x0120)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ROOT_DOWN_CTRL_OFFSET     (0x0130)
#define IMXRT_GPC_SET_POINT_CTRL_SP_PLL_OFF_CTRL_OFFSET       (0x0140)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ISO_ON_CTRL_OFFSET        (0x0150)
#define IMXRT_GPC_SET_POINT_CTRL_SP_RESET_EARLY_CTRL_OFFSET   (0x0160)
#define IMXRT_GPC_SET_POINT_CTRL_SP_POWER_OFF_CTRL_OFFSET     (0x0170)
#define IMXRT_GPC_SET_POINT_CTRL_SP_BIAS_OFF_CTRL_OFFSET      (0x0180)
#define IMXRT_GPC_SET_POINT_CTRL_SP_BG_PLDO_OFF_CTRL_OFFSET   (0x0190)
#define IMXRT_GPC_SET_POINT_CTRL_SP_LDO_PRE_CTRL_OFFSET       (0x01a0)
#define IMXRT_GPC_SET_POINT_CTRL_SP_DCDC_DOWN_CTRL_OFFSET     (0x01b0)
#define IMXRT_GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_OFFSET       (0x0200)
#define IMXRT_GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_OFFSET      (0x0210)
#define IMXRT_GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_OFFSET    (0x0220)
#define IMXRT_GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_OFFSET       (0x0230)
#define IMXRT_GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_OFFSET      (0x0240)
#define IMXRT_GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_OFFSET    (0x0250)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_OFFSET       (0x0260)
#define IMXRT_GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_OFFSET        (0x0270)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_OFFSET       (0x0280)
#define IMXRT_GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_OFFSET      (0x0290)
#define IMXRT_GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_OFFSET       (0x02a0)
#define IMXRT_GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_OFFSET  (0x02b0)

/* GPC_SET_POINT_CTRL Register Addresses *****************************************/
#define IMXRT_GPC_SET_POINT_CTRL_BASE                  (IMXRT_GPC_BASE + IMXRT_GPC_SET_POINT_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_AUTHEN_CTRL        (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_AUTHEN_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_INT_CTRL           (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_INT_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_CPU_REQ            (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_CPU_REQ_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_SYS_STAT           (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_SYS_STAT_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ROSC_CTRL          (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_ROSC_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_PRIORITY_0_7       (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_PRIORITY_0_7_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_PRIORITY_8_15      (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_PRIORITY_8_15_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_SSAR_SAVE_CTRL     (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_SSAR_SAVE_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_LPCG_OFF_CTRL      (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_LPCG_OFF_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_GROUP_DOWN_CTRL    (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_GROUP_DOWN_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ROOT_DOWN_CTRL     (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_ROOT_DOWN_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_PLL_OFF_CTRL       (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_PLL_OFF_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ISO_ON_CTRL        (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_ISO_ON_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_RESET_EARLY_CTRL   (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_RESET_EARLY_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_POWER_OFF_CTRL     (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_POWER_OFF_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_BIAS_OFF_CTRL      (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_BIAS_OFF_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_BG_PLDO_OFF_CTRL   (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_BG_PLDO_OFF_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_LDO_PRE_CTRL       (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_LDO_PRE_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_DCDC_DOWN_CTRL     (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_DCDC_DOWN_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL       (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL      (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL    (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL       (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL      (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL    (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL       (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL        (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL       (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL      (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL       (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_OFFSET)
#define IMXRT_GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL  (IMXRT_GPC_SET_POINT_CTRL_BASE + IMXRT_GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_OFFSET)

