apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_gpc.h
/* SP DCDC up control (SP_DCDC_UP_CTRL) */
#define GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_DCDC_UP_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP LDO post control (SP_LDO_POST_CTRL) */
#define GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_LDO_POST_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP bandgap and PLL_LDO on control (SP_BG_PLDO_ON_CTRL) */
#define GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_BG_PLDO_ON_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP bias on control (SP_BIAS_ON_CTRL) */
#define GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_BIAS_ON_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP power on control (SP_POWER_ON_CTRL) */
#define GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_POWER_ON_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP reset late control (SP_RESET_LATE_CTRL) */
#define GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_RESET_LATE_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP ISO off control (SP_ISO_OFF_CTRL) */
#define GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_ISO_OFF_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

