apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_gpc.h
/* SP PLL on control (SP_PLL_ON_CTRL) */
#define GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_PLL_ON_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP root up control (SP_ROOT_UP_CTRL) */
#define GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_ROOT_UP_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP group up control (SP_GROUP_UP_CTRL) */
#define GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_GROUP_UP_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP LPCG on control (SP_LPCG_ON_CTRL) */
#define GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_LPCG_ON_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* SP SSAR restore control (SP_SSAR_RESTORE_CTRL) */
#define GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_STEP_CNT_SHIFT)
#define GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_STEP_CNT(n)     (((n) << GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_STEP_CNT_SHIFT) & GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_STEP_CNT_MASK)
#define GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_CNT_MODE_MASK   (0x3 << GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_CNT_MODE_SHIFT)
#define GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_CNT_MODE(n)     (((n) << GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_CNT_MODE_SHIFT) & GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_CNT_MODE_MASK)
#define GPC_SET_POINT_CTRL_SP_SSAR_RESTORE_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* GPC_STBY_CTRL Register Offsets ************************************************/
#define IMXRT_GPC_STBY_CTRL_OFFSET                        (0x2800)
#define IMXRT_GPC_STBY_CTRL_STBY_AUTHEN_CTRL_OFFSET       (0x0004)
#define IMXRT_GPC_STBY_CTRL_STBY_MISC_OFFSET              (0x000c)
#define IMXRT_GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_OFFSET      (0x00f0)
#define IMXRT_GPC_STBY_CTRL_STBY_PLL_IN_CTRL_OFFSET       (0x0100)
#define IMXRT_GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_OFFSET      (0x0110)
#define IMXRT_GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_OFFSET      (0x0120)
#define IMXRT_GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_OFFSET   (0x0128)
#define IMXRT_GPC_STBY_CTRL_STBY_LDO_IN_CTRL_OFFSET       (0x0130)
#define IMXRT_GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_OFFSET      (0x0140)
#define IMXRT_GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_OFFSET      (0x0150)
#define IMXRT_GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_OFFSET     (0x0200)
#define IMXRT_GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_OFFSET     (0x0210)
#define IMXRT_GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_OFFSET      (0x0220)
#define IMXRT_GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_OFFSET  (0x0230)
#define IMXRT_GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_OFFSET     (0x0238)
#define IMXRT_GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_OFFSET     (0x0240)
#define IMXRT_GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_OFFSET      (0x0250)
#define IMXRT_GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_OFFSET     (0x0260)

/* GPC_STBY_CTRL Register Addresses **********************************************/
#define IMXRT_GPC_STBY_CTRL_BASE                   (IMXRT_GPC_BASE + IMXRT_GPC_STBY_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_AUTHEN_CTRL       (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_AUTHEN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_MISC              (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_MISC_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_LPCG_IN_CTRL      (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_PLL_IN_CTRL       (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_PLL_IN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_BIAS_IN_CTRL      (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_PLDO_IN_CTRL      (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL   (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_LDO_IN_CTRL       (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_LDO_IN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_DCDC_IN_CTRL      (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_PMIC_IN_CTRL      (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL     (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL     (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_LDO_OUT_CTRL      (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL  (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL     (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL     (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_PLL_OUT_CTRL      (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_OFFSET)
#define IMXRT_GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL     (IMXRT_GPC_STBY_CTRL_BASE + IMXRT_GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_OFFSET)

