apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_gpc.h
/* Standby Authentication Control (STBY_AUTHEN_CTRL) */
#define GPC_STBY_CTRL_STBY_AUTHEN_CTRL_LOCK_CFG  (1 << 20)  /* Bit 20: Configuration lock */

/* STBY Misc (STBY_MISC) */
#define GPC_STBY_CTRL_STBY_MISC_FORCE_CPU0_STBY  (1 << 0)  /* Bit 0: Force CPU0 requesting standby mode */
#define GPC_STBY_CTRL_STBY_MISC_FORCE_CPU1_STBY  (1 << 1)  /* Bit 1: Force CPU0 requesting standby mode */
#define GPC_STBY_CTRL_STBY_MISC_FORCE_CPU2_STBY  (1 << 2)  /* Bit 2: Force CPU2 requesting standby mode */
#define GPC_STBY_CTRL_STBY_MISC_FORCE_CPU3_STBY  (1 << 3)  /* Bit 3: Force CPU3 requesting standby mode */

/* STBY lpcg_in control (STBY_LPCG_IN_CTRL) */
#define GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_LPCG_IN_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY pll_in control (STBY_PLL_IN_CTRL) */
#define GPC_STBY_CTRL_STBY_PLL_IN_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_PLL_IN_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_PLL_IN_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_PLL_IN_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_PLL_IN_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_PLL_IN_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_PLL_IN_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_PLL_IN_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_PLL_IN_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_PLL_IN_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_PLL_IN_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_PLL_IN_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_PLL_IN_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY bias_in control (STBY_BIAS_IN_CTRL) */
#define GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_BIAS_IN_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY pldo_in control (STBY_PLDO_IN_CTRL) */
#define GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_PLDO_IN_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY bandgap_in control (STBY_BANDGAP_IN_CTRL) */
#define GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_BANDGAP_IN_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY ldo_in control (STBY_LDO_IN_CTRL) */
#define GPC_STBY_CTRL_STBY_LDO_IN_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_LDO_IN_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_LDO_IN_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_LDO_IN_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_LDO_IN_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_LDO_IN_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_LDO_IN_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_LDO_IN_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_LDO_IN_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_LDO_IN_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_LDO_IN_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_LDO_IN_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_LDO_IN_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY dcdc_in control (STBY_DCDC_IN_CTRL) */
#define GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_DCDC_IN_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY PMIC in control (STBY_PMIC_IN_CTRL) */
#define GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_PMIC_IN_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY PMIC out control (STBY_PMIC_OUT_CTRL) */
#define GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_PMIC_OUT_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY DCDC out control (STBY_DCDC_OUT_CTRL) */
#define GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_DCDC_OUT_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY LDO out control (STBY_LDO_OUT_CTRL) */
#define GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_LDO_OUT_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY bandgap out control (STBY_BANDGAP_OUT_CTRL) */
#define GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_BANDGAP_OUT_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY pldo out control (STBY_PLDO_OUT_CTRL) */
#define GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_PLDO_OUT_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY bias out control (STBY_BIAS_OUT_CTRL) */
#define GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_BIAS_OUT_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY PLL out control (STBY_PLL_OUT_CTRL) */
#define GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_PLL_OUT_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

/* STBY LPCG out control (STBY_LPCG_OUT_CTRL) */
#define GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_STEP_CNT_SHIFT  (0)        /* Bits 0-16: Step count, usage is depending on CNT_MODE */
#define GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_STEP_CNT_MASK   (0xFFFF << GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_STEP_CNT_SHIFT)
#define GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_STEP_CNT(n)     (((n) << GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_STEP_CNT_SHIFT) & GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_STEP_CNT_MASK)
#define GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_CNT_MODE_SHIFT  (28)       /* Bits 28-30: Count mode */
#define GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_CNT_MODE_MASK   (0x3 << GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_CNT_MODE_SHIFT)
#define GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_CNT_MODE(n)     (((n) << GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_CNT_MODE_SHIFT) & GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_CNT_MODE_MASK)
#define GPC_STBY_CTRL_STBY_LPCG_OUT_CTRL_DISABLE         (1 << 31)  /* Bit 31: Disable this step */

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_GPC_H */
